app/Controllers/Client.php

SELECT *
FROM `clients`
WHERE `id` = 1
SELECT *
FROM `operateur_prefixe`
WHERE `prefixe` = '034'
SELECT *
FROM `operateur_prefixe`
WHERE `operateur_id` = 1
---
    public function transfert()
    {
        $db = \Config\Database::connect();
        $clientId = session()->get('user_id');

        $client = $db->table('clients')->where('id', $clientId)->get()->getRow();
        $prefixeClient = substr($client->numero, 0, 3);
        $operateurClient = $db->table('operateur_prefixe')
            ->where('prefixe', $prefixeClient)
            ->get()
            ->getRow();

        $prefixesAutorises = [];
        if ($operateurClient) {
            $prefixes = $db->table('operateur_prefixe')
                ->where('operateur_id', $operateurClient->operateur_id)
                ->get()
                ->getResult();