app/Controllers/OperateurController.php

SELECT *
FROM `operateur`
WHERE `nom` != 'YAS'
---
    public function clientAjouter()
    {
        $yas = $this->operateurModel->where('nom', 'YAS')->first();
        $prefixes  = $yas ? $this->operateurModel->getPrefixes($yas->id) : [];

        return view('Opérateur/client_ajouter', [
            'prefixes'  => $prefixes,
            'operateurs' => $this->operateurModel->findAll(),
        ]);

SELECT *
FROM `commission`
---
    public function commissions()
    {
        $commissions = $this->commissionModel->findAll();

SELECT *
FROM `commission`
---
    public function commissionSupprimer($id = null)
    {
        $this->commissionModel->delete($id, true);
        return redirect()->to('/operateur/commissions')->with('success', 'Commission supprimée.');