app/Controllers/OperateurController.php

SELECT `transactions`.*, `transaction_type`.`label` AS `type_label`, `clients`.`numero` AS `client_numero`
FROM `transactions`
LEFT JOIN `transaction_type` ON `transaction_type`.`id` = `transactions`.`transaction_type_id`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
ORDER BY `transactions`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `transaction_type`
SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
SELECT COUNT(*) AS `numrows`
FROM `transaction_type`
---
    public function index()
    {
        $operateur = $this->currentOperateur();
        $filtre = $this->prefixesFiltre();

        $builder = $this->transactionModel->builder()
            ->select('transactions.*, transaction_type.label AS type_label, clients.numero AS client_numero')
            ->join('transaction_type', 'transaction_type.id = transactions.transaction_type_id', 'left')
            ->join('clients', 'clients.id = transactions.client_id', 'left')
            ->orderBy('transactions.created_at', 'DESC')
            ->limit(5);
        $this->applyOperateurFiltre($builder);
        $dernieres = $builder->get()->getResult();

        $types = [];
        foreach ($this->typeModel->findAll() as $t) {
            $types[$t->id] = $t;
        }

        $nbClients = $this->clientModel->builder();
        $this->applyOperateurFiltre($nbClients);
        $nbClients = $nbClients->countAllResults();

        $nbTransac = $this->transactionModel->builder()
            ->join('clients', 'clients.id = transactions.client_id', 'left');
        $this->applyOperateurFiltre($nbTransac);
        $nbTransac = $nbTransac->countAllResults();

        $data = [
            'operateur'  => $operateur,
            'nbPrefixes' => $operateur->id ? $this->prefixeModel->where('operateur_id', $operateur->id)->countAllResults() : $this->prefixeModel->countAllResults(),
            'nbTypes'    => $this->typeModel->countAllResults(),
            'nbClients'  => $nbClients,
            'nbTransac'  => $nbTransac,
            'gains'      => $this->totalGains(),
            'dernieres'  => $dernieres,
            'types'      => $types,
            'operateurs' => $this->operateurModel->findAll(),
        ];

SELECT SUM(`frais_applique`) AS `total`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
WHERE `status` = 'Reussi'
AND `transactions`.`transaction_type_id` IN (2,3)
---
    private function totalGains(): float
    {
        $builder = $this->transactionModel->builder()
            ->join('clients', 'clients.id = transactions.client_id', 'left');
        $this->applyOperateurFiltre($builder);
        $builder->selectSum('frais_applique', 'total')
            ->where('status', 'Reussi')
            ->whereIn('transactions.transaction_type_id', [2, 3]);
        $row = $builder->get()->getRow();

SELECT *
FROM `transaction_type`
---
    public function montantSupprimer($id = null)
    {
        $tranche = $this->montantModel->find($id);
        if (! $tranche) {
            return redirect()->to('/operateur/types');
        }
        $typeId = $tranche->transaction_type_id;
        $this->montantModel->delete($id);
        return redirect()->to("/operateur/montants/$typeId")->with('success', 'Tranche supprimée.');

SELECT *
FROM `transaction_type`
SELECT SUM(`frais_applique`) AS `total`, SUM(`montant`) AS `volume`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
WHERE `transactions`.`transaction_type_id` = 1
AND `status` = 'Reussi'
---
    public function gains()
    {
        $types   = $this->typeModel->findAll();
        $details = [];
        $total   = 0;

        foreach ($types as $type) {
            $builder = $this->transactionModel->builder()
                ->join('clients', 'clients.id = transactions.client_id', 'left');
            $this->applyOperateurFiltre($builder);
            $builder->selectSum('frais_applique', 'total')
                ->selectSum('montant', 'volume')
                ->where('transactions.transaction_type_id', $type->id)
                ->where('status', 'Reussi');
            $row = $builder->get()->getRow();
            $gain = (float) ($row->total ?? 0);
            $volume = (float) ($row->volume ?? 0);
            $total += $gain;
            $details[] = [
                'type'   => $type,
                'gain'   => $gain,
                'volume' => $volume,
            ];
        }

        return view('Opérateur/gains', [
            'operateur' => $this->currentOperateur(),
            'details'   => $details,
            'total'     => $total,
            'operateurs' => $this->operateurModel->findAll(),
        ]);

SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL
---
    public function comptes()
    {
        $builder = $this->clientModel->builder();
        $this->applyOperateurFiltre($builder);
        $clients = $builder->orderBy('numero', 'ASC')->get()->getResult();

        $totalSolde = 0;
        foreach ($clients as $client) {
            $nb = $this->transactionModel->builder()
                ->join('clients', 'clients.id = transactions.client_id', 'left')
                ->where('client_id', $client->id);
            $this->applyOperateurFiltre($nb);
            $client->nbTransac = $nb->countAllResults();
            $totalSolde += (float) $client->solde;
        }

        return view('Opérateur/comptes', [
            'operateur'  => $this->currentOperateur(),
            'clients'    => $clients,
            'totalSolde' => $totalSolde,
            'operateurs' => $this->operateurModel->findAll(),
        ]);

SELECT *
FROM `clients`
WHERE `clients`.`deleted_at` IS NULL
AND `clients`.`id` = '1'
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL
AND `operateur`.`id` = 1
---
    public function clientModifier($id = null)
    {
        $client = $this->clientModel->find($id);
        if (! $client) {
            return redirect()->to('/operateur/comptes')->with('error', 'Client introuvable.');
        }

        return view('Opérateur/client_modifier', [
            'operateur' => $this->currentOperateur(),
            'client'    => $client,
            'operateurs' => $this->operateurModel->findAll(),
        ]);