app/Controllers/OperateurController.php

    public function index()
    {
        $dernieres = $this->transactionModel->builder()
            ->select('transactions.*, transaction_type.label AS type_label, clients.numero AS client_numero')
            ->join('transaction_type', 'transaction_type.id = transactions.transaction_type_id', 'left')
            ->join('clients', 'clients.id = transactions.client_id', 'left')
            ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
            ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left')
            ->where('operateur.nom', 'YAS')
            ->orderBy('transactions.created_at', 'DESC')
            ->limit(5)
            ->get()->getResult();

        $types = [];
        foreach ($this->typeModel->findAll() as $t) {
            $types[$t->id] = $t;
        }

        $nbClients = $this->clientModel->builder()
            ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
            ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left')
            ->where('operateur.nom', 'YAS')
            ->countAllResults();

        $nbTransac = $this->transactionModel->builder()
            ->join('clients', 'clients.id = transactions.client_id', 'left')
            ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
            ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left')
            ->where('operateur.nom', 'YAS')
            ->countAllResults();
---
SELECT `transactions`.*, `transaction_type`.`label` AS `type_label`, `clients`.`numero` AS `client_numero`
FROM `transactions`
LEFT JOIN `transaction_type` ON `transaction_type`.`id` = `transactions`.`transaction_type_id`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `operateur`.`nom` = 'YAS'
ORDER BY `transactions`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `transaction_type`
SELECT COUNT(*) AS `numrows`
FROM `clients`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `operateur`.`nom` = 'YAS'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `operateur`.`nom` = 'YAS'

            'gains'      => $this->totalGains(),
            'dernieres'  => $dernieres,
            'types'      => $types,
            'operateurs' => $this->operateurModel->findAll(),
---
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

    private function totalGains(): float
    {
        $builder = $this->transactionModel->builder()
            ->join('clients', 'clients.id = transactions.client_id', 'left')
            ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
            ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left')
            ->selectSum('frais_applique', 'total')
            ->where('status', 'Reussi')
            ->where('operateur.nom', 'YAS')
            ->whereIn('transactions.transaction_type_id', [2, 3]);
        $row = $builder->get()->getRow();
---
SELECT SUM(`frais_applique`) AS `total`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `status` = 'Reussi'
AND `operateur`.`nom` = 'YAS'
AND `transactions`.`transaction_type_id` IN (2,3)

    public function types()
    {
        $types = $this->typeModel->findAll();

        foreach ($types as $type) {
            $type->tranches = $this->montantModel->getByType($type->id);
        }

        return view('Opérateur/types', [
            'types'     => $types,
            'operateurs' => $this->operateurModel->findAll(),
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

    public function montantSupprimer($id = null)
    {
        $tranche = $this->montantModel->find($id);
        if (! $tranche) {
            return redirect()->to('/operateur/types');
        }
        $typeId = $tranche->transaction_type_id;
        $this->montantModel->delete($id);
        return redirect()->to("/operateur/montants/$typeId")->with('success', 'Tranche supprimée.');
---
SELECT *
FROM `transaction_type`

    public function gains()
    {
        $types = $this->typeModel->findAll();
        $detailsYas = [];
        $detailsAutres = [];
        $totalYas = 0;
        $totalAutres = 0;
        $totalCommissions = 0;

        foreach ($types as $type) {
            // Gains YAS
            $builderYas = $this->transactionModel->builder()
                ->join('clients', 'clients.id = transactions.client_id', 'left')
                ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
                ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left');
            $builderYas->selectSum('frais_applique', 'total')
                ->selectSum('montant', 'volume')
                ->where('transactions.transaction_type_id', $type->id)
                ->where('operateur.nom', 'YAS')
                ->where('status', 'Reussi');
            $rowYas = $builderYas->get()->getRow();
            $gainYas = (float) ($rowYas->total ?? 0);
            $volumeYas = (float) ($rowYas->volume ?? 0);
            $totalYas += $gainYas;

            // Gains autres opérateurs (frais)
            $builderAutres = $this->transactionModel->builder()
                ->join('clients', 'clients.id = transactions.client_id', 'left')
                ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
                ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left');
            $builderAutres->selectSum('frais_applique', 'total')
                ->selectSum('montant', 'volume')
                ->where('transactions.transaction_type_id', $type->id)
                ->where('operateur.nom !=', 'YAS')
                ->where('status', 'Reussi');
---
SELECT SUM(`frais_applique`) AS `total`, SUM(`montant`) AS `volume`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `transactions`.`transaction_type_id` = 1
AND `operateur`.`nom` = 'YAS'
AND `status` = 'Reussi'
SELECT `clients`.*, `operateur`.`nom` as `operateurNom`, COUNT(transactions.id) as nbTransac
FROM `clients`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
LEFT JOIN `transactions` ON `transactions`.`client_id` = `clients`.`id`
WHERE `operateur`.`nom` = 'YAS'
AND `clients`.`deleted_at` IS NULL
GROUP BY `clients`.`id`, `operateur`.`nom`
ORDER BY `clients`.`numero` ASC
SELECT SUM(`frais_applique`) AS `total`, SUM(`montant`) AS `volume`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `transactions`.`transaction_type_id` = 1
AND `operateur`.`nom` != 'YAS'
AND `status` = 'Reussi'

                    ->join('clients', 'clients.id = transactions.client_id', 'left')
                    ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
                    ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left');
                $builderCom->selectSum('commission', 'total_com')
                    ->where('transactions.transaction_type_id', $type->id)
                    ->where('operateur.nom !=', 'YAS')
                    ->where('status', 'Reussi');
                $rowCom = $builderCom->get()->getRow();
---
SELECT SUM(`commission`) AS `total_com`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
WHERE `transactions`.`transaction_type_id` = 3
AND `operateur`.`nom` != 'YAS'
AND `status` = 'Reussi'
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

            ];
        }

        return view('Opérateur/gains', [
            'detailsYas'     => $detailsYas,
            'detailsAutres'  => $detailsAutres,
            'totalYas'       => $totalYas,
            'totalAutres'    => $totalAutres,
            'totalCommissions' => $totalCommissions,
            'operateurs'     => $this->operateurModel->findAll(),
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

    public function montantsEnvoyes()
    {
        $db = \Config\Database::connect();

        $operateurs = $db->table('operateur')
            ->where('nom !=', 'YAS')
            ->get()
            ->getResult();

        $resultats = [];
        foreach ($operateurs as $op) {
            // Montant total envoye PAR YAS VERS cet operateur (destinataire commence par un prefixe de cet operateur)
            $destPrefixes = $db->table('operateur_prefixe')
                ->where('operateur_id', $op->id)
                ->get()
                ->getResult();
---
SELECT *
FROM `operateur`
WHERE `nom` != 'YAS'
SELECT *
FROM `operateur_prefixe`
WHERE `operateur_id` = 2

            }

            // Montant total recu PAR YAS DEPUIS cet operateur (emetteur appartient a cet operateur)
            $recu = $db->table('transactions')
                ->join('clients', 'clients.id = transactions.client_id', 'left')
                ->join('operateur_prefixe', "SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe", 'left')
                ->where('operateur_prefixe.operateur_id', $op->id)
                ->where('transactions.transaction_type_id', 3)
                ->where('status', 'Reussi')
                ->selectSum('montant', 'total_recu')
                ->get()
                ->getRow();
---
SELECT SUM(`montant`) AS `total_recu`
FROM `transactions`
LEFT JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
WHERE `operateur_prefixe`.`operateur_id` = 2
AND `transactions`.`transaction_type_id` = 3
AND `status` = 'Reussi'

            ];
        }

        return view('Opérateur/montants_envoyes', [
            'resultats' => $resultats,
            'operateurs' => $this->operateurModel->findAll(),
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

    public function comptes()
    {
        $clients = $this->clientModel
            ->select('clients.*, operateur.nom as operateurNom, COUNT(transactions.id) as nbTransac')
            ->join('operateur_prefixe', 'SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe', 'left')
            ->join('operateur', 'operateur.id = operateur_prefixe.operateur_id', 'left')
            ->join('transactions', 'transactions.client_id = clients.id', 'left')
            ->where('operateur.nom', 'YAS')
            ->groupBy('clients.id, operateur.nom')
            ->orderBy('clients.numero', 'ASC')
            ->findAll();

        $totalSolde = array_sum(array_column($clients, 'solde'));

        return view('Opérateur/comptes', [
            'clients'    => $clients,
            'totalSolde' => $totalSolde,
            'operateurs' => $this->operateurModel->findAll(),
        ]);
---
SELECT `clients`.*, `operateur`.`nom` as `operateurNom`, COUNT(transactions.id) as nbTransac
FROM `clients`
LEFT JOIN `operateur_prefixe` ON SUBSTR(clients.numero, 1, 3) = operateur_prefixe.prefixe
LEFT JOIN `operateur` ON `operateur`.`id` = `operateur_prefixe`.`operateur_id`
LEFT JOIN `transactions` ON `transactions`.`client_id` = `clients`.`id`
WHERE `operateur`.`nom` = 'YAS'
AND `clients`.`deleted_at` IS NULL
GROUP BY `clients`.`id`, `operateur`.`nom`
ORDER BY `clients`.`numero` ASC
SELECT `transactions`.*, `transaction_type`.`label`, `transaction_type`.`code`
FROM `transactions`
LEFT JOIN `transaction_type` ON `transaction_type`.`id` = `transactions`.`transaction_type_id`
WHERE `transactions`.`client_id` = '1'
ORDER BY `transactions`.`created_at` DESC
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL

    public function clientAjouter()
    {
        $yas = $this->operateurModel->where('nom', 'YAS')->first();
        $prefixes  = $yas ? $this->operateurModel->getPrefixes($yas->id) : [];

        return view('Opérateur/client_ajouter', [
            'prefixes'  => $prefixes,
            'operateurs' => $this->operateurModel->findAll(),
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`deleted_at` IS NULL