app/Controllers/Transaction.php

SELECT *
FROM `montant`
WHERE `transaction_type_id` = 3
AND `min_montant` <= 50000
AND `max_montant` >= 50000
SELECT *
FROM `clients`
WHERE `id` = 1
SELECT *
FROM `montant`
WHERE `transaction_type_id` = 3
AND `min_montant` <= '5000'
AND `max_montant` >= '5000'
SELECT *
FROM `clients`
WHERE `numero` = '0321000001'
---
    public function faireTransfert()
    {
        $montant = (float) $this->request->getPost('montant');
        $destinataire = trim($this->request->getPost('destinataire') ?? '');
        $db = \Config\Database::connect();
        $clientId = session()->get('user_id');
        $typeTransaction = 3;

        $row = $db->table('montant')
            ->where('transaction_type_id', $typeTransaction)
            ->where('min_montant <=', $montant)
            ->where('max_montant >=', $montant)
            ->get()
            ->getRow();

        $fraisTransaction = $row ? (float) $row->frais_montant : 0;
        $fraisMode = $this->request->getPost('frais_mode') ?? 'deductible';

        if ($montant + $fraisTransaction > session()->get('user_solde')) {
            return redirect()->to('/transfert')->with('error', 'Solde insuffisant pour effectuer ce transfert.');
        }

        $emetteur = $db->table('clients')->where('id', $clientId)->get()->getRow();
        $destinataireRow = $db->table('clients')
            ->where('numero', $destinataire)
            ->get()
            ->getRow();

SELECT *
FROM `operateur_prefixe`
WHERE `prefixe` = '034'
SELECT *
FROM `operateur_prefixe`
WHERE `prefixe` = '032'
---
        }

        $sourcePrefixe = substr($emetteur->numero, 0, 3);
        $sourceOpRow = $db->table('operateur_prefixe')
            ->where('prefixe', $sourcePrefixe)
            ->get()
            ->getRow();
        $sourceOpId = $sourceOpRow ? (int) $sourceOpRow->operateur_id : null;

        $destPrefixe = substr($destinataireRow->numero, 0, 3);
        $destOpRow = $db->table('operateur_prefixe')
            ->where('prefixe', $destPrefixe)
            ->get()
            ->getRow();

SELECT *
FROM `commission`
WHERE `operateur_source_id` = 1
AND `operateur_destinataire_id` = 2
AND `est_actif` = 1
---

        $commission = 0.0;
        if ($sourceOpId && $destOpId && $sourceOpId != $destOpId) {
            $com = $db->table('commission')
                ->where('operateur_source_id', $sourceOpId)
                ->where('operateur_destinataire_id', $destOpId)
                ->where('est_actif', 1)
                ->get()
                ->getRow();

UPDATE `clients` SET `solde` = 46710
WHERE `id` = 1
UPDATE `clients` SET `solde` = 579800
WHERE `id` = 24
INSERT INTO `transactions` (`client_id`, `transaction_type_id`, `montant`, `frais_applique`, `montant_net`, `commission`, `destinataire_numero`, `reference`, `status`) VALUES (1, 3, 50000, 500, 50000, 500, '0321000001', 'TXN-20260721-3843', 'Reussi')
---
        $db->transStart();

        session()->set('user_solde', $nouveauSoldeEmetteur);
        $db->table('clients')
            ->where('id', $clientId)
            ->update(['solde' => $nouveauSoldeEmetteur]);

        $db->table('clients')
            ->where('id', $destinataireRow->id)
            ->update(['solde' => $nouveauSoldeDestinataire]);

        $db->table('transactions')->insert([
            'client_id' => $clientId,
            'transaction_type_id' => $typeTransaction,
            'montant' => $montant,
            'frais_applique' => $fraisTransaction,
            'montant_net' => $montantRecu,
            'commission' => $commission,
            'destinataire_numero' => $destinataire,
            'reference' => $reference,
            'status' => 'Reussi',
        ]);

SELECT *
FROM `montant`
WHERE `transaction_type_id` = 3
AND `min_montant` <= 10000
AND `max_montant` >= 10000
SELECT *
FROM `clients`
WHERE `id` = 1
SELECT *
FROM `operateur_prefixe`
WHERE `prefixe` = '034'
SELECT *
FROM `clients`
WHERE `numero` = '0321000001'
SELECT *
FROM `operateur_prefixe`
WHERE `prefixe` = '032'
SELECT *
FROM `commission`
WHERE `operateur_source_id` = 1
AND `operateur_destinataire_id` = 2
AND `est_actif` = 1
---
    public function calculFrais()
    {
        $type = (int) $this->request->getPost('type');
        $montant = (float) $this->request->getPost('montant');
        $destinataire = trim($this->request->getPost('destinataire') ?? '');
        $fraisMode = $this->request->getPost('frais_mode') ?? 'deductible';
        $db = \Config\Database::connect();

        $row = $db->table('montant')
            ->where('transaction_type_id', $type)
            ->where('min_montant <=', $montant)
            ->where('max_montant >=', $montant)
            ->get()
            ->getRow();

        $fraisTransaction = $row ? (float) $row->frais_montant : 0;
        $commission = 0.0;
        $montantRecu = $montant;
        $totalDebit = $montant + $fraisTransaction;

        if ($type == 3 && !empty($destinataire)) {
            $emetteur = $db->table('clients')->where('id', session()->get('user_id'))->get()->getRow();
            if ($emetteur) {
                $sourcePrefixe = substr($emetteur->numero, 0, 3);
                $sourceOpRow = $db->table('operateur_prefixe')->where('prefixe', $sourcePrefixe)->get()->getRow();
                $destRow = $db->table('clients')->where('numero', $destinataire)->get()->getRow();
                if ($destRow) {
                    $destPrefixe = substr($destRow->numero, 0, 3);
                    $destOpRow = $db->table('operateur_prefixe')->where('prefixe', $destPrefixe)->get()->getRow();
                    $sourceOpId = $sourceOpRow ? (int) $sourceOpRow->operateur_id : null;
                    $destOpId = $destOpRow ? (int) $destOpRow->operateur_id : null;
                    if ($sourceOpId && $destOpId && $sourceOpId != $destOpId) {
                        $com = $db->table('commission')
                            ->where('operateur_source_id', $sourceOpId)
                            ->where('operateur_destinataire_id', $destOpId)
                            ->where('est_actif', 1)
                            ->get()
                            ->getRow();