app/Models/OperateurModel.php

    public function getPrefixes(?int $operateurId)
    {
        $builder = $this->db->table('operateur_prefixe');
        if ($operateurId !== null) {
            $builder->where('operateur_id', $operateurId);
        }
        return $builder->orderBy('prefixe', 'ASC')->get()->getResult();
---
SELECT *
FROM `operateur_prefixe`
WHERE `operateur_id` = 1
ORDER BY `prefixe` ASC